tutorials/twoFluidsNBSuspensionFoam/migrationPoiseuillePeriodic/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 5;
        nAlphaOffDiagCorr 8;


        smoothLimiter   0.1;

        implicitPhasePressure no;
        solver          PCG;
        preconditioner	diagonal;
        tolerance       1e-7;
        relTol          0;
        minIter         0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner	diagonal;
        tolerance       1e-5;
        relTol          1e-05;
        maxIter         50;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
        maxIter 1000;
    }

    "U.*|Theta.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0;
        minIter         1;
    }



}

PIMPLE
{
    nOuterCorrectors    6;
    nCorrectors         8;
    nNonOrthogonalCorrectors 0;
    pRefCell 1;
    pRefValue 100000;
    faceMomentum  on;

    residualControl
    {
        p_rgh           1e-5;
        "U.*"           1e-5;
 //       "alpha.*"       1e-3;
    }

}

relaxationFactors
{
    equations
    {

         "U.fluid|U.particles"  0.7;
         p_rgh        0.5;

         "(U.fluid|U.particles)Final"  1;
         p_rghFinal 1;
    }
}


// ************************************************************************* //
